name: "resnet_torch"
backend: "pytorch"
max_batch_size: 128


input [
  {
    name: "INPUT__0"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 32, 32]
  }
]

output [
  {
    name: "OUTPUT__0"
    data_type: TYPE_FP32
    dims: [ 10 ]
    label_filename: "labels.txt"
  }
]

instance_group [
  {
    count: 2,
    kind: KIND_GPU
  }
]
